// 正则  没有 ^$  则表示：只要字符串中有符合正则的部分即可
// 有^$ 代表  整个字符串 必须全部满足正则条件

//1==========================编写一个正则 可以匹配  有效数字
// 可以有+-号。可以是小数，整数第一项不能是0
var reg = /^[+-]?([1-9]\d+|\d)(\.\d+)?$/

//2=========================匹配手机号
//以1开头  
var reg = /^1[3-9]\d{9}$/;

//3========================QQ邮箱验证
//至少5位  不能以0开头  至多11位
var reg = /^[1-9]\d{4,10}@qq\.com$/i

//3=========================  密码 8-18 ：既有大写 又有小写；还有数字
function judge (str) {
    if (str.length > 18 || str.length < 8) return false;
    if (!/[A-Z]/.test(str)) return false;
    if (!/[A-Z]/.test(str)) return false;
    if (!/[A-Z]/.test(str)) return false;
    return true; 
}

//4========================匹配一个 18-65 年龄段
var reg = /^(1[89])|([2-5]\d)|(6[0-5])$/